-- phpMyAdmin SQL Dump
-- version 4.8.3
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Aug 25, 2022 at 03:12 PM
-- Server version: 10.1.37-MariaDB
-- PHP Version: 7.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `webdesignapps`
--

-- --------------------------------------------------------

--
-- Table structure for table `data_2sep`
--

CREATE TABLE `data_2sep` (
  `id` int(11) NOT NULL,
  `list` text NOT NULL,
  `grade` enum('ป.4','ป.5','ป.6','ม.1','ม.2','ม.3','ม.ปลาย') DEFAULT NULL,
  `typ` enum('ชาย','หญิง') NOT NULL,
  `team` varchar(5) NOT NULL,
  `tus` enum('แข่งแล้ว','ยังไม่ได้แข่ง','ยกเลิกรายการ','') NOT NULL,
  `no1` enum('สีขาว','สีเหลือง','สีแดง','สีน้ำเงิน','สีแสด','สีเขียว') NOT NULL,
  `no2` enum('สีขาว','สีเหลือง','สีแดง','สีน้ำเงิน','สีแสด','สีเขียว') NOT NULL,
  `no3` enum('สีขาว','สีเหลือง','สีแดง','สีน้ำเงิน','สีแสด','สีเขียว') NOT NULL,
  `sta` time NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- Dumping data for table `data_2sep`
--

INSERT INTO `data_2sep` (`id`, `list`, `grade`, `typ`, `team`, `tus`, `no1`, `no2`, `no3`, `sta`) VALUES
(1, '    วิ่งผลัด 8x50 เมตร', 'ป.4', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(2, 'วิ่งผลัด 8x50 เมตร', 'ป.5', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(3, 'วิ่งผลัด 8x50 เมตร', 'ป.6', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(4, 'วิ่งผลัด 8x50 เมตร', 'ม.1', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(5, 'วิ่งผลัด 8x50 เมตร', 'ป.4', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(6, 'วิ่งผลัด 8x50 เมตร', 'ป.5', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(7, 'วิ่งผลัด 8x50 เมตร', 'ป.6', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(8, 'วิ่งผลัด 8x50 เมตร', 'ม.1', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(9, 'วิ่ง 60 เมตร', 'ป.4', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(10, 'วิ่ง 60 เมตร', 'ป.4', 'ชาย', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(11, 'วิ่ง 60 เมตร', 'ป.4', 'ชาย', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(12, 'วิ่ง 60 เมตร', 'ป.4', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(13, 'วิ่ง 60 เมตร', 'ป.4', 'หญิง', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(14, 'วิ่ง 60 เมตร', 'ป.5', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(15, 'วิ่ง 60 เมตร', 'ป.5', 'ชาย', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(16, 'วิ่ง 60 เมตร', 'ป.5', 'ชาย', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(17, 'วิ่ง 60 เมตร', 'ป.5', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(18, 'วิ่ง 60 เมตร', 'ป.5', 'หญิง', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(19, 'วิ่ง 60 เมตร', 'ป.6', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(20, 'วิ่ง 60 เมตร', 'ป.6', 'ชาย', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(21, 'วิ่ง 60 เมตร', 'ป.6', 'ชาย', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(22, 'วิ่ง 60 เมตร', 'ป.6', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(23, 'วิ่ง 60 เมตร', 'ป.6', 'หญิง', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(24, 'วิ่ง 60 เมตร', 'ม.1', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(25, 'วิ่ง 60 เมตร', 'ม.1', 'ชาย', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(26, 'วิ่ง 60 เมตร', 'ม.1', 'ชาย', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(27, 'วิ่ง 60 เมตร', 'ม.1', 'หญิง', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(28, 'วิ่ง 60 เมตร', 'ม.1', 'หญิง', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(29, 'วิ่ง 60 เมตร', 'ม.1', 'หญิง', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(30, 'วิ่ง 60 เมตร', 'ม.2', 'ชาย', 'A', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(31, 'วิ่ง 60 เมตร', 'ม.2', 'ชาย', 'B', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00'),
(32, '    วิ่ง 60 เมตร', 'ม.2', 'หญิง', 'C', 'ยังไม่ได้แข่ง', '', '', '', '00:00:00');

--
-- Indexes for dumped tables
--

--
-- Indexes for table `data_2sep`
--
ALTER TABLE `data_2sep`
  ADD PRIMARY KEY (`id`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
